app/controllers/movies_controller.rb

  def index
    @movies = Movie.all.order("created_at DESC")
---
SELECT "movies".* FROM "movies" ORDER BY created_at DESC

  def create
    @movie = Movie.new(movie_params)

    respond_to do |format|
      if @movie.save
---
INSERT INTO "movies" ("created_at", "updated_at", "title", "description", "director") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", 2017-01-09 15:15:06 UTC], ["updated_at", 2017-01-09 15:15:06 UTC], ["title", "harry potter"], ["description", "sdadad"], ["director", "sadadasd"]]