app/controllers/reviews_controller.rb

  def create
    @review = Review.new(review_params)

    respond_to do |format|
      if @review.save
---
INSERT INTO "reviews" ("rating", "description", "created_at", "updated_at", "movie_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["rating", 2], ["description", "asdfs"], ["created_at", 2017-01-09 19:03:06 UTC], ["updated_at", 2017-01-09 19:03:06 UTC], ["movie_id", 2]]

  def destroy
    @review.destroy
---
DELETE FROM "reviews" WHERE "reviews"."id" = $1  [["id", 2]]